ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.c
/*
 * stm32f4_can_LL.c
 *
 *  Created on: Jul 3, 2024
 *      Author: dell
 */

#include "stm32f4_can_ll.h"
#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_bus.h"
#include <stdlib.h>
#include "main.h"

// Global variables
CAN_TypeDef_t *canbase;

// Static prototypes
static void Trans(CAN_TypeDef_t *canbase, const uint8_t data[], LL_CAN_TxHeaderTypeDef_t *htxheader, uint32_t *TxMailBox);
static uint32_t Calculate_APB1_clk();
/**
 * The function `LL_CAN_GPIO_Init` initializes GPIO pins for CAN communication based on the specified
 * CAN type.
 *
 * @param can_type The `can_type` parameter in the `LL_CAN_GPIO_Init` function is used to determine
 * which CAN bus (CAN1 or CAN2) configuration to initialize based on the value passed to it. The
 * function configures the GPIO pins for CAN communication based on the specified CAN type.
 */
ErrorStatus LL_CAN_GPIO_Init(LL_CAN_Handler_t *hcan)
{

	ErrorStatus status = ERROR;
	LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

	/* Peripheral clock enable */
	if (hcan->Instance == _CAN1)
		RCC->APB1ENR |= RCC_APB1ENR_CAN1EN;
	else
		RCC->APB1ENR |= RCC_APB1ENR_CAN2EN;

	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);

	if (hcan->Instance == _CAN1)
	{
		/**CAN1 GPIO Configuration
		PB8   ------> CAN1_RX
		PB9   ------> CAN1_TX
		*/
		GPIO_InitStruct.Pin = LL_GPIO_PIN_8 | LL_GPIO_PIN_9;
		GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
		GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
		GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
		GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
		GPIO_InitStruct.Alternate = LL_GPIO_AF_9;
		LL_GPIO_Init(GPIOB, &GPIO_InitStruct);
		status = SUCCESS;
	}
	else if (hcan->Instance == _CAN2)
	{
		/**CAN1 GPIO Configuration
		PB12   ------> CAN2_RX
		PB13   ------> CAN2_TX
		*/
		GPIO_InitStruct.Pin = LL_GPIO_PIN_12 | LL_GPIO_PIN_13;
		GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
		GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
		GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
		GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
		GPIO_InitStruct.Alternate = LL_GPIO_AF_9;
		LL_GPIO_Init(GPIOB, &GPIO_InitStruct);
		status = SUCCESS;
	}

	else
		status = ERROR;

	return status;
}

/**
 * The function `LL_CAN_Init` initializes a CAN module based on the provided configuration parameters.
 *
 * @param can_type The `can_type` parameter in the `LL_CAN_Init` function is used to specify which CAN
 * instance to initialize. It is of type `LL_CAN_TypeDef`, which likely represents the CAN hardware
 * instance (e.g., CAN1 or CAN2).
 * @param hcan The `hcan` parameter is a pointer to a structure of type `LL_CAN_InitTypeDef` which
 * contains configuration settings for initializing a CAN (Controller Area Network) module. The
 * structure likely includes fields such as `Baudrate`, `Mode`, and `status` which in turn contains
 * flags for
 *
 * @return The function `LL_CAN_Init` is returning an `ErrorStatus` enum value, which is either `ERROR`
 * or `SUCCESS`.
 */
ErrorStatus LL_CAN_Init(LL_CAN_Handler_t *hcan)
{

	ErrorStatus status = ERROR;
	uint8_t time_out = 50;
	uint8_t time_start = 0;
//	assert_param(hcan->Init.Prescaler);
//	assert_param(hcan->Init.SyncJumpWidth);
//	assert_param(hcan->Init.TimeSeg1);
//	assert_param(hcan->Init.TimeSeg2);
	assert_param(hcan->Init.Mode);
	assert_param(hcan->Init.status.AutoBusOff);
	assert_param(hcan->Init.status.AutoRetransmission);
	assert_param(hcan->Init.status.AutoWakeUp);
	assert_param(hcan->Init.status.ReceiveFifoLocked);
	assert_param(hcan->Init.status.TimeTriggeredMode);
	assert_param(hcan->Init.status.TransmitFifoPriority);

	// Check CAN instance is CAN1 or CAN2
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
		status = SUCCESS;
	}
	else if (hcan->Instance == _CAN2)
	{
		canbase = _CAN2_REG_BASE;
		status = SUCCESS;
	}

	// Enter Initialization mode
	(canbase->CAN_MCR) |= (1U << INRQ);

	// Wait until INAK bit has been set by hardware.
	while (!((canbase->CAN_MSR) & (1U << INAK)) && (time_start < time_out))
	{
		++time_start;
	}
	if (time_start > time_out)
		return ERROR;
	// Reset time start
	time_start = 0;

	// Exit sleep mode
	(canbase->CAN_MCR) &= ~(1U << SLEEP);

	// Wait until bit SLAK=0 of MSR register
	while (!((canbase->CAN_MSR) & (1U << SLAK)) && (time_start < time_out))
	{
		++time_start;
	}
	if (time_start > time_out)
		return ERROR;

	// Configure CAN mode
	switch (hcan->Init.Mode)
	{
	case _NORMAL_MODE:
		(canbase->CAN_BTR) |= _CAN_MODE_NORMAL;
		break;
	case _LOOPBACK_MODE:
		(canbase->CAN_BTR) |= _CAN_MODE_LOOPBACK;
		break;
	case _SILENT_MODE:
		(canbase->CAN_BTR) |= _CAN_MODE_SILENT;
		break;
	case _SILENT_LOOPBACK_MODE:
		(canbase->CAN_BTR) |= _CAN_MODE_SILENT_LOOPBACK;
		break;
	}

	// Clear bits of SJW | BRP | TS1 | TS2
	(canbase->CAN_BTR) &= 0xF0000000;

	switch(Calculate_APB1_clk())
	{
	case APB1_4MHZ:  hcan->Init.SyncJumpWidth = _CAN_SJW_1TQ;
					 hcan->Init.Prescaler = 1;
					 hcan->Init.TimeSeg1 = _CAN_BS1_6TQ;
					 hcan->Init.TimeSeg2 = _CAN_BS2_1TQ;
					 break;
	case APB1_8MHZ:  hcan->Init.SyncJumpWidth = _CAN_SJW_1TQ;
					 hcan->Init.Prescaler = 1;
					 hcan->Init.TimeSeg1 = _CAN_BS1_13TQ;
					 hcan->Init.TimeSeg2 = _CAN_BS2_2TQ;
					 break;
	case APB1_12MHZ: hcan->Init.SyncJumpWidth = _CAN_SJW_1TQ;
					 hcan->Init.Prescaler = 2;
					 hcan->Init.TimeSeg1 = _CAN_BS1_10TQ;
					 hcan->Init.TimeSeg2 = _CAN_BS2_1TQ;
					 break;
	case APB1_24MHZ: hcan->Init.SyncJumpWidth = _CAN_SJW_1TQ;
					 hcan->Init.Prescaler = 3;
					 hcan->Init.TimeSeg1 = _CAN_BS1_13TQ;
					 hcan->Init.TimeSeg2 = _CAN_BS2_2TQ;
					 break;
	default: while(1);//Error APB1 clock is not match with options above
	}
	// Can baudrate calculation bases on F_APB1=24Mhz, SJW | BRP | TS1 | TS2
	(canbase->CAN_BTR) |= (((hcan->Init.SyncJumpWidth) << SJW) | (((hcan->Init.Prescaler) - 1) << BRP) | ((hcan->Init.TimeSeg1) << TS1) | ((hcan->Init.TimeSeg2) << TS2));

	// Can Autowakeup, default value of bit AWUM=0
	if (hcan->Init.status.AutoWakeUp == ENABLE)
		(canbase->CAN_MCR) |= (1U << AWUM);
	else
		(canbase->CAN_MCR) &= ~(1U << AWUM);

	// Can No Autorestranmission, default value of bit NART=0
	if (hcan->Init.status.AutoRetransmission == DISABLE)
		(canbase->CAN_MCR) |= (1U << NART);
	else
		(canbase->CAN_MCR) &= ~(1U << NART);

	// Can ReceiveFifoLocked, default value of bit RFLM=0
	if (hcan->Init.status.ReceiveFifoLocked == ENABLE)
		(canbase->CAN_MCR) |= (1U << RFLM);
	else
		(canbase->CAN_MCR) &= ~(1U << RFLM);

	// Can Time trigger mode, default value of bit TTCM=0
	if (hcan->Init.status.TimeTriggeredMode == ENABLE)
		(canbase->CAN_MCR) |= (1U << TTCM);
	else
		(canbase->CAN_MCR) &= ~(1U << TTCM);

	// Can TransmitFifoPriority, default value of bit TXFP=0
	if (hcan->Init.status.TransmitFifoPriority == ENABLE)
		(canbase->CAN_MCR) |= (1U << TXFP);
	else
		(canbase->CAN_MCR) &= ~(1U << TXFP);

	// Can AutoBusOff, default value of bit ABOM=0
	if (hcan->Init.status.AutoBusOff == ENABLE)
		canbase->CAN_MCR |= (1U << ABOM);
	else
		(canbase->CAN_MCR) &= ~(1U << ABOM);

