ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.c
	return status;
}

/**
 * The function LL_CAN_ConfigFilter configures CAN filter settings based on the provided parameters.
 *
 * @param hcan The `hcan` parameter is a pointer to a structure `LL_CAN_Handler_t` which contains
 * information about the CAN handler, including the CAN instance (`Instance`) which can be either
 * `_CAN1` or `_CAN2`.
 * @param hfilter - FilterActivation: Indicates whether the filter is enabled or disabled.
 *
 * @return The function `ErrorStatus LL_CAN_ConfigFilter(LL_CAN_Handler_t *hcan, LL_CAN_FilterTypeDef_t
 * *hfilter)` is returning the status of the configuration process, which is either `SUCCESS` or
 * `ERROR`.
 */
ErrorStatus LL_CAN_ConfigFilter(LL_CAN_Handler_t *hcan, LL_CAN_FilterTypeDef_t *hfilter)
{
	ErrorStatus status = ERROR;
	uint32_t filter_bank_pos;
	// Check CAN`s instance is CAN1 or CAN2
	status = SUCCESS;
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
		status = SUCCESS;
	}
	else
	{
		canbase = _CAN2_REG_BASE;
		status = SUCCESS;
	}

	// Check the parameters
	assert_param(hfilter->FilterActivation);
	assert_param(hfilter->FilterBank);
	assert_param(hfilter->FilterFIFOAssignment);
	assert_param(hfilter->FilterID);
	assert_param(hfilter->FilterMask);
	assert_param(hfilter->FilterMode);
	assert_param(hfilter->FilterScale);
	assert_param(hfilter->SlaveStartFilterBank);

	// Don`t have SlaveStartFilterBank configuration

	// Init filter mode
	(canbase->CAN_FMR) |= (1U << FINIT);

	// Select the start filter number of CAN2 slave instance
	if (hcan->Instance == _CAN1)
	{
		(canbase->CAN_FMR) &= ~(1U << CAN2SB);
		(canbase->CAN_FMR) |= ((hfilter->SlaveStartFilterBank) << CAN2SB);
	}

	// Convert filter bank number into bit position
	filter_bank_pos = (1U << ((hfilter->FilterBank) & 0x1FU));

	// Filter deactivation
	(canbase->CAN_FA1R) &= ~(filter_bank_pos);

	// Config filter scale
	if (hfilter->FilterScale == _CAN_FILTERSCALE_16BIT)
	{
		(canbase->CAN_FS1R) &= ~(filter_bank_pos);

		// First 16-bit identifier and First 16-bit mask
		// Or First 16-bit identifier and Second 16-bit identifier
		(canbase->CAN_sFilterRegister[hfilter->FilterBank].FR1) =
			((0x0000FFFFU & (uint32_t)hfilter->FilterMaskIdLow) << 16U) |
			(0x0000FFFFU & (uint32_t)hfilter->FilterIdLow);

		// Second 16-bit identifier and Second 16-bit mask */
		//  Or Third 16-bit identifier and Fourth 16-bit identifier */
		(canbase->CAN_sFilterRegister[hfilter->FilterBank].FR2) =
			((0x0000FFFFU & (uint32_t)hfilter->FilterMaskIdHigh) << 16U) |
			(0x0000FFFFU & (uint32_t)hfilter->FilterIdHigh);
	}
	if (hfilter->FilterScale == _CAN_FILTERSCALE_32BIT)
	{
		(canbase->CAN_FS1R) |= (filter_bank_pos);

		// 32-bit identifier or First 32-bit identifier
		(canbase->CAN_sFilterRegister[hfilter->FilterBank].FR1) =
			((0x0000FFFFU & (uint32_t)hfilter->FilterIdHigh) << 16U) |
			(0x0000FFFFU & (uint32_t)hfilter->FilterIdLow);

		// 32-bit mask or Second 32-bit identifier
		(canbase->CAN_sFilterRegister[hfilter->FilterBank].FR2) =
			((0x0000FFFFU & (uint32_t)hfilter->FilterMaskIdHigh) << 16U) |
			(0x0000FFFFU & (uint32_t)hfilter->FilterMaskIdLow);
	}

	// Config filter mode
	if (hfilter->FilterMode == _CAN_FILTERMODE_IDMASK)
	{
		(canbase->CAN_FM1R) &= ~(filter_bank_pos);
	}
	else
	{
		(canbase->CAN_FM1R) |= (filter_bank_pos);
	}
	// Config filter FIFO assignment (FIFO0 or FIFO1)
	if (hfilter->FilterFIFOAssignment == _CAN_FILTER_FIFO0)
	{
		(canbase->CAN_FFA1R) &= ~(filter_bank_pos);
	}
	else
	{
		(canbase->CAN_FFA1R) |= (filter_bank_pos);
	}

	// Filter activation
	if (hfilter->FilterActivation == _CAN_FILTER_ENABLE)
	{
		(canbase->CAN_FA1R) |= (filter_bank_pos);
	}
	else
	{
		(canbase->CAN_FA1R) &= ~(filter_bank_pos);
	}

	// Leave the initialisation mode for the filter
	(canbase->CAN_FMR) &= ~(1U << FINIT);
	return status;
}

/**
 * The function LL_CAN_Start initializes and starts a CAN bus communication interface.
 *
 * @param hcan The `hcan` parameter is a pointer to a structure of type `LL_CAN_Handler_t`, which
 * likely contains information about the CAN (Controller Area Network) handler or controller being used
 * in the code. The function `LL_CAN_Start` is responsible for starting the CAN communication and
 * configuring the controller.
 *
 * @return The function LL_CAN_Start is returning an ErrorStatus enum value, which can be either
 * SUCCESS or ERROR.
 */
ErrorStatus LL_CAN_Start(LL_CAN_Handler_t *hcan)
{
	ErrorStatus status = ERROR;
	uint8_t time_out = 50;
	uint8_t time_start = 0;
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
		status = SUCCESS;
	}
	else if (hcan->Instance == _CAN2)
	{
		canbase = _CAN2_REG_BASE;
		status = SUCCESS;
	}

	// Leave Initialization mode
	(canbase->CAN_MCR) &= ~(1U << INRQ);
	// Wait until INAK bit has been cleared by hardware.
	while (((canbase->CAN_MSR) & (1U << INAK)) && (time_start < time_out))
	{
		++time_start;
	}
	if (time_start > time_out)
		status = ERROR;
	else
		status = SUCCESS;
	return status;
}

/**
 * The function `LL_CAN_AddTxMessage` adds a transmit message to a CAN bus and checks if any mailbox is
 * empty for transmission.
 *
 * @param hcan `hcan` is a pointer to a structure `LL_CAN_Handler_t` which likely contains information
 * about the CAN controller and its configuration.
 * @param data An array of uint8_t data to be transmitted via CAN bus.
 * @param htxheader - _DLC: Data Length Code
 * @param TxMailBox The `TxMailBox` parameter in the `LL_CAN_AddTxMessage` function is a pointer to a
 * `uint32_t` variable that will be used to store the mailbox number where the transmitted message is
 * placed. This variable will be updated by the function `Trans` which is called if there
 *
 * @return The function `ErrorStatus LL_CAN_AddTxMessage` is returning the status of the operation,
 * which can be either `SUCCESS` or `ERROR`.
 */
ErrorStatus LL_CAN_AddTxMessage(LL_CAN_Handler_t *hcan, const uint8_t data[], LL_CAN_TxHeaderTypeDef_t *htxheader, uint32_t *TxMailBox)
{
	ErrorStatus status = ERROR;

	// Check the parameters
	assert_param(data);
	assert_param(htxheader->_DLC);
	assert_param(htxheader->_IDE);
	assert_param(htxheader->_RTR);
	assert_param(htxheader->TransmitGlobalTime);

