ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.c
	if (htxheader->_IDE == _CAN_ID_STD)
	{
		assert_param(htxheader->StdId);
	}
	else
	{
		assert_param(htxheader->ExtId);
	}
	// Check CAN`s instance is CAN1 or CAN2
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
	}
	else
	{
		canbase = _CAN2_REG_BASE;
	}

	// Check if any mailbox is empty
	if (((canbase->CAN_TSR) & (1U << TME0)) || ((canbase->CAN_TSR) & (1U << TME1)) || ((canbase->CAN_TSR) & (1U << TME2)))
	{
		Trans(canbase, data, htxheader, TxMailBox);
		status = SUCCESS;
	}

	return status;
}

/**
 * The function `Trans` sets up and transmits a CAN message using the provided data and header
 * information.
 *
 * @param canbase The `canbase` parameter in the `Trans` function is a pointer to a structure of type
 * `CAN_TypeDef_t`, which likely represents a CAN (Controller Area Network) peripheral in a
 * microcontroller or embedded system. This structure would contain registers and configurations
 * related to the CAN module, allowing you to
 * @param data The `data` parameter in the `Trans` function is an array of uint8_t type, which
 * represents the data to be transmitted over the CAN bus. The array contains 8 elements, with index 0
 * to 7, where each element holds a byte of data to be sent.
 * @param htxheader The `htxheader` parameter is a pointer to a structure of type
 * `LL_CAN_TxHeaderTypeDef_t`. This structure likely contains information related to the CAN message
 * transmission, such as the message ID, data length, RTR bit, IDE bit, Transmit Global Time flag, etc.
 * @param TxMailBox The `TxMailBox` parameter is a pointer to a `uint32_t` variable where the function
 * will store the selected transmit mailbox for sending the CAN message.
 */
static void Trans(CAN_TypeDef_t *canbase, const uint8_t data[], LL_CAN_TxHeaderTypeDef_t *htxheader, uint32_t *TxMailBox)
{

	uint32_t transmitmailbox;

	// Select an empty transmit mailbox
	transmitmailbox = (((canbase->CAN_TSR) >> CODE) & 0x03);
	*TxMailBox = transmitmailbox;
	// Set up the ID
	if (htxheader->_IDE == _CAN_ID_STD)
	{
		(canbase->sTxMailBox[transmitmailbox].TIR) = ((htxheader->StdId) << STID) | ((htxheader->_RTR) << RTR);
	}
	else
	{
		(canbase->sTxMailBox[transmitmailbox].TIR) = (((htxheader->ExtId) << EXID) | ((htxheader->_RTR) << RTR) | ((htxheader->_IDE) << IDE));
	}

	// Set up the DLC
	(canbase->sTxMailBox[transmitmailbox].TDTR) = ((htxheader->_DLC) << DLC);
	// Set up the Transmit Global Time mode
	if (htxheader->TransmitGlobalTime == ENABLE)
	{
		canbase->sTxMailBox[transmitmailbox].TDTR |= ((htxheader->TransmitGlobalTime) << TGT);
	}

	// Set up data
	(canbase->sTxMailBox[transmitmailbox].TDHR) = (((uint32_t)data[7] << CAN_TDHR_DATA7_Pos) | ((uint32_t)data[6] << CAN_TDHR_DATA6_Pos) | ((uint32_t)data[5] << CAN_TDHR_DATA5_Pos) | ((uint32_t)data[4] << CAN_TDHR_DATA4_Pos));
	(canbase->sTxMailBox[transmitmailbox].TDLR) = ((uint32_t)(data[3] << CAN_TDLR_DATA3_Pos) | ((uint32_t)data[2] << CAN_TDLR_DATA2_Pos) | ((uint32_t)data[1] << CAN_TDLR_DATA1_Pos) | ((uint32_t)data[0] << CAN_TDLR_DATA0_Pos));

	// Request transmission by enable bit TXRQ
	(canbase->sTxMailBox[transmitmailbox].TIR) |= (1UL << TXRQ);
}

/**
 * The function checks if there is a pending transmission request on a specific Tx mailbox of a CAN
 * controller.
 *
 * @param hcan The `hcan` parameter is a pointer to a structure `LL_CAN_Handler_t` which likely
 * contains information about the CAN controller being used, such as the instance (CAN1 or CAN2).
 * @param TxMailBox The `TxMailBox` parameter in the `ErrorStatus LL_CAN_IsTxMessagePending` function
 * represents the mailbox number of the CAN controller where the transmission message is pending. It is
 * used to check if there is a pending transmission request on the selected Tx mailbox specified by the
 * user.
 *
 * @return an ErrorStatus value, which can be either ERROR or SUCCESS.
 */
ErrorStatus LL_CAN_IsTxMessagePending(LL_CAN_Handler_t *hcan, uint32_t *TxMailBox)
{
	ErrorStatus status = ERROR;
	// Check CAN`s instance is CAN1 or CAN2
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
	}
	else
	{
		canbase = _CAN2_REG_BASE;
	}
	// Check pending transmission request on the selected Tx Mailboxes
	if (!((canbase->CAN_TSR) & ((1U << *TxMailBox) << TME0)))
	{
		status = SUCCESS;
	}
	return status;
}

/**
 * The function `LL_CAN_GetRxFifoFillLevel` retrieves the fill level of a specified receive FIFO in a
 * CAN peripheral.
 *
 * @param hcan The `hcan` parameter is a pointer to a structure `LL_CAN_Handler_t` which likely
 * contains information about the CAN handler, such as the CAN instance (CAN1 or CAN2).
 * @param RxFifo RxFifo is the receive FIFO (First In First Out) buffer in a CAN (Controller Area
 * Network) controller. In this function, it is used to specify which receive FIFO buffer to check for
 * fill level - either FIFO0 or FIFO1.
 *
 * @return The function `LL_CAN_GetRxFifoFillLevel` returns the fill level of the specified receive
 * FIFO (RxFifo) for the given CAN handler (hcan).
 */
uint32_t LL_CAN_GetRxFifoFillLevel(LL_CAN_Handler_t *hcan, uint32_t RxFifo)
{
	uint32_t filllevel = 0U;

	// Check CAN`s instance is CAN1 or CAN2
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
	}
	else
	{
		canbase = _CAN2_REG_BASE;
	}

	if (RxFifo == _CAN_RX_FIFO0)
	{
		filllevel = (canbase->CAN_RF0R & (3U << FMP0));
	}
	else /* RxFifo == _CAN_RX_FIFO1 */
	{
		filllevel = (canbase->CAN_RF1R & (3U << FMP1));
	}
	return filllevel;
}

/**
 * The function `LL_CAN_GetRxMessage` retrieves a received CAN message from the specified CAN hardware
 * instance and populates the header and data into the provided structures.
 *
 * @param hcan The `hcan` parameter is a pointer to a structure `LL_CAN_Handler_t` which contains
 * information about the CAN controller instance being used.
 * @param hrxheader The `hrxheader` parameter is a pointer to a structure of type
 * `LL_CAN_RxHeaderTypeDef_t`. This structure likely contains fields to store information about the
 * received CAN message, such as the ID, DLC, RTR, Filter Match Index, Timestamp, etc. The function
 * `Error
 * @param rxdata The `rxdata` parameter is an array where the received CAN message data will be stored.
 * It is expected to be a valid memory location where the data can be written to by the function.
 * @param RxFifo The `RxFifo` parameter in the provided function `ErrorStatus LL_CAN_GetRxMessage` is
 * used to specify which Receive FIFO (0 or 1) to read the message from. It is an input parameter that
 * determines from which FIFO the message should be retrieved.
 *
 * @return either SUCCESS or ERROR based on the conditions checked within the function. If the Rx FIFO
 * is empty or if there is a parameter error, the function will return ERROR. Otherwise, it will return
 * SUCCESS after successfully retrieving the CAN message data.
 */
ErrorStatus LL_CAN_GetRxMessage(LL_CAN_Handler_t *hcan, LL_CAN_RxHeaderTypeDef_t *hrxheader, uint8_t rxdata[], uint32_t RxFifo)
{
	// Check the parameters
	assert_param(rxdata);
	assert_param(RxFifo);

	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
	}
	else
	{
		canbase = _CAN2_REG_BASE;
	}

	/* Check the Rx FIFO */
	if (RxFifo == _CAN_RX_FIFO0) /* Rx element is assigned to Rx FIFO 0 */
	{
		/* Check that the Rx FIFO 0 is not empty */
		if (((canbase->CAN_RF0R) & (1 << FMP0)) == 0U)
		{
			/* Update error code */
			hcan->ErrorCode |= LL_CAN_ERROR_PARAM;

