ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.c
			return ERROR;
		}
	}
	else /* Rx element is assigned to Rx FIFO 1 */
	{
		/* Check that the Rx FIFO 1 is not empty */
		if (((canbase->CAN_RF1R) & (1 << FMP1)) == 0U)
		{
			/* Update error code */
			hcan->ErrorCode |= LL_CAN_ERROR_PARAM;

			return ERROR;
		}
	}

	// Get ID
	hrxheader->_IDE = (((1U << IDE_rx) & (canbase->sFIFOMailBox[RxFifo].RIR)) >> IDE_rx);
	if (hrxheader->_IDE == _CAN_ID_STD)
	{
		hrxheader->StdId = (((0x7FF << STID_rx) & (canbase->sFIFOMailBox[RxFifo].RIR)) >> STID_rx);
	}
	else
	{
		hrxheader->ExtId = (((0x1FFFFFFF << EXID_rx) & (canbase->sFIFOMailBox[RxFifo].RIR)) >> EXID);
	}

	// Get Remote transmission request
	hrxheader->_RTR = (((1U << RTR_rx) & (canbase->sFIFOMailBox[RxFifo].RIR)) >> RTR_rx);
	if ((((0xF << DLC_rx) & (canbase->sFIFOMailBox[RxFifo].RDTR)) >> DLC_rx) >= 8U)
	{
		/* Truncate DLC to 8 if received field is over range */
		hrxheader->_DLC = 8U;
	}
	else
	{
		hrxheader->_DLC = (((0xF << DLC_rx) & (canbase->sFIFOMailBox[RxFifo].RDTR)) >> DLC_rx);
	}

	hrxheader->FilterMatchIndex = (((0xFF << FMI_rx) & (canbase->sFIFOMailBox[RxFifo].RDTR)) >> FMI_rx);
	hrxheader->Timestamp = (((0xFFFF << TIME_rx) & (canbase->sFIFOMailBox[RxFifo].RDTR)) >> TIME_rx);

	/* Get the data */
	rxdata[0] = (uint8_t)(((0XFF << CAN_RDLR_DATA0_Pos) & (canbase->sFIFOMailBox[RxFifo].RDLR)) >> CAN_RDLR_DATA0_Pos);
	rxdata[1] = (uint8_t)(((0XFF << CAN_RDLR_DATA1_Pos) & (canbase->sFIFOMailBox[RxFifo].RDLR)) >> CAN_RDLR_DATA1_Pos);
	rxdata[2] = (uint8_t)(((0XFF << CAN_RDLR_DATA2_Pos) & (canbase->sFIFOMailBox[RxFifo].RDLR)) >> CAN_RDLR_DATA2_Pos);
	rxdata[3] = (uint8_t)(((0XFF << CAN_RDLR_DATA3_Pos) & (canbase->sFIFOMailBox[RxFifo].RDLR)) >> CAN_RDLR_DATA3_Pos);
	rxdata[4] = (uint8_t)(((0XFF << CAN_RDHR_DATA4_Pos) & (canbase->sFIFOMailBox[RxFifo].RDHR)) >> CAN_RDHR_DATA4_Pos);
	rxdata[5] = (uint8_t)(((0XFF << CAN_RDHR_DATA5_Pos) & (canbase->sFIFOMailBox[RxFifo].RDHR)) >> CAN_RDHR_DATA5_Pos);
	rxdata[6] = (uint8_t)(((0XFF << CAN_RDHR_DATA6_Pos) & (canbase->sFIFOMailBox[RxFifo].RDHR)) >> CAN_RDHR_DATA6_Pos);
	rxdata[7] = (uint8_t)(((0XFF << CAN_RDHR_DATA7_Pos) & (canbase->sFIFOMailBox[RxFifo].RDHR)) >> CAN_RDHR_DATA7_Pos);

	/* Release the FIFO */
	if (RxFifo == _CAN_RX_FIFO0) /* Rx element is assigned to Rx FIFO 0 */
	{
		/* Release RX FIFO 0 */
		(canbase->CAN_RF0R) |= (1U << RFOM0);
	}
	else /* Rx element is assigned to Rx FIFO 1 */
	{
		/* Release RX FIFO 1 */
		(canbase->CAN_RF1R) |= (1U << RFOM1);
	}

	return SUCCESS;
}
/**
 * The function LL_CAN_ActivateInterrupt activates selected interrupts for a CAN handler based on the
 * specified ActiveITs.
 *
 * @param hcan The `hcan` parameter is a pointer to a structure of type `LL_CAN_Handler_t`, which
 * likely contains information and configurations related to a CAN (Controller Area Network) peripheral
 * in a microcontroller.
 * @param ActiveITs The `ActiveITs` parameter in the `LL_CAN_ActivateInterrupt` function is used to
 * specify which interrupts should be enabled. It is a bitmask where each bit corresponds to a specific
 * interrupt source. By ORing the `ActiveITs` bitmask with the `CAN_IER` register,
 */

void LL_CAN_ActivateInterrupt(LL_CAN_Handler_t *hcan, uint32_t ActiveITs)
{
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
	}
	else
	{
		canbase = _CAN2_REG_BASE;
	}
	/* Enable the selected interrupts */
	(canbase->CAN_IER) |= (ActiveITs);
}

/*
  ==============================================================================
						  ##### Callback functions #####
  ==============================================================================
	[..]
	This subsection provides the following callback functions:
	  (+) LL_CAN_TxMailbox0CompleteCallback
	  (+) LL_CAN_TxMailbox1CompleteCallback
	  (+) LL_CAN_TxMailbox2CompleteCallback
	  (+) LL_CAN_TxMailbox0AbortCallback
	  (+) LL_CAN_TxMailbox1AbortCallback
	  (+) LL_CAN_TxMailbox2AbortCallback
	  (+) LL_CAN_RxFifo0MsgPendingCallback
	  (+) LL_CAN_RxFifo0FullCallback
	  (+) LL_CAN_RxFifo1MsgPendingCallback
	  (+) LL_CAN_RxFifo1FullCallback
	  (+) LL_CAN_SleepCallback
	  (+) LL_CAN_WakeUpFromRxMsgCallback
	  (+) LL_CAN_ErrorCallback
*/

/**
 * @brief  Transmission Mailbox 0 complete callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_TxMailbox0CompleteCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_TxMailbox0CompleteCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Transmission Mailbox 1 complete callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_TxMailbox1CompleteCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_TxMailbox1CompleteCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Transmission Mailbox 2 complete callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_TxMailbox2CompleteCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_TxMailbox2CompleteCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Transmission Mailbox 0 Cancellation callback.
 * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_TxMailbox0AbortCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_TxMailbox0AbortCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Transmission Mailbox 1 Cancellation callback.
 * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_TxMailbox1AbortCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_TxMailbox1AbortCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Transmission Mailbox 2 Cancellation callback.
 * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_TxMailbox2AbortCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_TxMailbox2AbortCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Rx FIFO 0 message pending callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_RxFifo0MsgPendingCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_RxFifo0MsgPendingCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Rx FIFO 0 full callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_RxFifo0FullCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_RxFifo0FullCallback could be implemented in the user
			  file
	 */
}

/**
 * @brief  Rx FIFO 1 message pending callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_RxFifo1MsgPendingCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_RxFifo1MsgPendingCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Rx FIFO 1 full callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_RxFifo1FullCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_RxFifo1FullCallback could be implemented in the user
			  file
	 */
}

/**
 * @brief  Sleep callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_SleepCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_SleepCallback could be implemented in the user file
	 */
}

/**
 * @brief  WakeUp from Rx message callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_WakeUpFromRxMsgCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_WakeUpFromRxMsgCallback could be implemented in the
			  user file
	 */
}

/**
 * @brief  Error CAN callback.
 * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
__weak void LL_CAN_ErrorCallback(LL_CAN_Handler_t *hcan)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(&hcan);

	/* NOTE : This function Should not be modified, when the callback is needed,
			  the LL_CAN_ErrorCallback could be implemented in the user file
	 */
}

/**
 * The HAL_CAN_IRQHandler function handles various interrupts and error conditions in a CAN bus
 * communication system.
 *
 * @param hcan The `hcan` parameter in the `HAL_CAN_IRQHandler` function is a pointer to a
 * `CAN_HandleTypeDef` structure, which typically contains all the necessary information and
 * configurations for handling a CAN peripheral in an STM32 microcontroller. This structure is used to
 * access the CAN hardware registers and manage the CAN
 */
void LL_CAN_IRQHandler(LL_CAN_Handler_t *hcan)
{

	// Check CAN instance is CAN1 or CAN2
	if (hcan->Instance == _CAN1)
	{
		canbase = _CAN1_REG_BASE;
	}
	else
	{
		canbase = _CAN2_REG_BASE;
	}
	uint32_t errorcode = LL_CAN_ERROR_NONE;
	uint32_t interrupts = (canbase->CAN_IER);
	uint32_t msrflags = (canbase->CAN_MSR);
	uint32_t tsrflags = (canbase->CAN_TSR);
	uint32_t rf0rflags = (canbase->CAN_RF0R);
	uint32_t rf1rflags = (canbase->CAN_RF1R);
	uint32_t esrflags = (canbase->CAN_ESR);

	/* Transmit Mailbox empty interrupt management *****************************/
	if ((interrupts & (1U << TMEIE)) != 0U)
	{
		/* Transmit Mailbox 0 management *****************************************/
		if ((tsrflags & (1U << RQCP0)) != 0U)
		{
			/* Clear the Transmission Complete flag (and TXOK0,ALST0,TERR0 bits) */
			(canbase->CAN_TSR) |= (1U << RQCP0);

			if ((tsrflags & (1U << TXOK0)) != 0U)
			{
				/* Transmission Mailbox 0 complete callback */
				LL_CAN_TxMailbox0CompleteCallback(hcan);
			}
			else
			{
				if ((tsrflags & (1U << ALST0)) != 0U)
				{
					/* Update error code */
					errorcode |= LL_CAN_ERROR_TX_ALST0;
				}
				else if ((tsrflags & (1U << TERR0)) != 0U)
				{
					/* Update error code */
					errorcode |= LL_CAN_ERROR_TX_TERR0;
				}
				else
				{
					/* Transmission Mailbox 0 abort callback */
					LL_CAN_TxMailbox0AbortCallback(hcan);
				}
			}
		}

		/* Transmit Mailbox 1 management *****************************************/
		if ((tsrflags & (1U << RQCP1)) != 0U)
		{
			/* Clear the Transmission Complete flag (and TXOK1,ALST1,TERR1 bits) */
			tsrflags |= (1U << RQCP1);

			if ((tsrflags & (1U << TXOK1)) != 0U)
			{
				/* Transmission Mailbox 1 complete callback */
				LL_CAN_TxMailbox1CompleteCallback(hcan);
			}
			else
			{
				if ((tsrflags & (1U << ALST1)) != 0U)
				{
					/* Update error code */
					errorcode |= LL_CAN_ERROR_TX_ALST1;
				}
				else if ((tsrflags & CAN_TSR_TERR1) != 0U)
				{
					/* Update error code */
					errorcode |= LL_CAN_ERROR_TX_TERR1;
				}
				else
				{
					/* Transmission Mailbox 1 abort callback */
					LL_CAN_TxMailbox1AbortCallback(hcan);
				}
			}
		}

		/* Transmit Mailbox 2 management *****************************************/
		if ((tsrflags & (1U << RQCP2)) != 0U)
		{
			/* Clear the Transmission Complete flag (and TXOK2,ALST2,TERR2 bits) */
			tsrflags |= (1U << RQCP2);

