ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.c
			if ((tsrflags & (1U << TXOK2)) != 0U)
			{
				/* Transmission Mailbox 2 complete callback */
				LL_CAN_TxMailbox2CompleteCallback(hcan);
			}
			else
			{
				if ((tsrflags & (1U << ALST2)) != 0U)
				{
					/* Update error code */
					errorcode |= LL_CAN_ERROR_TX_ALST2;
				}
				else if ((tsrflags & (1U << TERR2)) != 0U)
				{
					/* Update error code */
					errorcode |= LL_CAN_ERROR_TX_TERR2;
				}
				else
				{
					/* Transmission Mailbox 2 abort callback */
					LL_CAN_TxMailbox2AbortCallback(hcan);
				}
			}
		}
	}

	/* Receive FIFO 0 overrun interrupt management *****************************/
	if ((interrupts & (1U << FOVIE0)) != 0U)
	{
		if ((rf0rflags & (1U << FOVR0)) != 0U)
		{
			/* Set CAN error code to Rx Fifo 0 overrun error */
			errorcode |= LL_CAN_ERROR_RX_FOV0;

			/* Clear FIFO0 Overrun Flag */
			(canbase->CAN_RF0R) &= ~(1U << FOVR0);
		}
	}

	/* Receive FIFO 0 full interrupt management ********************************/
	if ((interrupts & (1U << FFIE0)) != 0U)
	{
		if ((rf0rflags & (1U << FULL0)) != 0U)
		{
			/* Clear FIFO 0 full Flag */
			rf0rflags &= ~(1U << FULL0);

			/* Receive FIFO 0 full Callback */
			LL_CAN_RxFifo0FullCallback(hcan);
		}
	}

	/* Receive FIFO 0 message pending interrupt management *********************/
	if ((interrupts & (1U << FMPIE0)) != 0U)
	{
		/* Check if message is still pending */
		if ((rf0rflags & (3U << FMP0)) != 0U)
		{
			/* Receive FIFO 0 message pending Callback */
			LL_CAN_RxFifo0MsgPendingCallback(hcan);
		}
	}

	/* Receive FIFO 1 overrun interrupt management *****************************/
	if ((interrupts & (1U << FOVIE1)) != 0U)
	{
		if ((rf1rflags & (1U << FOVR1)) != 0U)
		{
			/* Set CAN error code to Rx Fifo 1 overrun error */
			errorcode |= LL_CAN_ERROR_RX_FOV1;

			/* Clear FIFO1 Overrun Flag */
			rf1rflags &= ~(1U << FOVR1);
		}
	}

	/* Receive FIFO 1 full interrupt management ********************************/
	if ((interrupts & (1U << FFIE1)) != 0U)
	{
		if ((rf1rflags & (1U << FULL1)) != 0U)
		{
			/* Clear FIFO 1 full Flag */
			rf1rflags &= ~(1U << FULL1);
			/* Receive FIFO 1 full Callback */
			LL_CAN_RxFifo1FullCallback(hcan);
		}
	}

	/* Receive FIFO 1 message pending interrupt management *********************/
	if ((interrupts & (1U << FMPIE1)) != 0U)
	{
		/* Check if message is still pending */
		if ((rf1rflags & (3U << FMP1)) != 0U)
		{
			/* Receive FIFO 1 message pending Callback */
			LL_CAN_RxFifo1MsgPendingCallback(hcan);
		}
	}

	/* Sleep interrupt management *********************************************/
	if ((interrupts & (1U << SLKIE)) != 0U)
	{
		if ((msrflags & (1U << SLAKI)) != 0U)
		{
			/* Clear Sleep interrupt Flag */
			msrflags &= ~(1U << SLAKI);

			/* Sleep Callback */
			LL_CAN_SleepCallback(hcan);
		}
	}

	/* WakeUp interrupt management *********************************************/
	if ((interrupts & (1U << WKUIE)) != 0U)
	{
		if ((msrflags & (WKUI)) != 0U)
		{
			/* Clear WakeUp Flag */
			msrflags &= ~(1U << WKUI);

			/* WakeUp Callback */
			LL_CAN_WakeUpFromRxMsgCallback(hcan);
		}
	}

	/* Error interrupts management *********************************************/
	if ((interrupts & (1U << ERRIE)) != 0U)
	{
		if ((msrflags & (1U << ERRI)) != 0U)
		{
			/* Check Error Warning Flag */
			if (((interrupts & (1U << EWGIE)) != 0U) &&
				((esrflags & (1U << EWGF)) != 0U))
			{
				/* Set CAN error code to Error Warning */
				errorcode |= LL_CAN_ERROR_EWG;

				/* No need for clear of Error Warning Flag as read-only */
			}

			/* Check Error Passive Flag */
			if (((interrupts & (1U << EPVIE)) != 0U) &&
				((esrflags & (1U << EPVF)) != 0U))
			{
				/* Set CAN error code to Error Passive */
				errorcode |= LL_CAN_ERROR_EPV;

				/* No need for clear of Error Passive Flag as read-only */
			}

			/* Check Bus-off Flag */
			if (((interrupts & (1U << BOFIE)) != 0U) &&
				((esrflags & (1U << BOFF)) != 0U))
			{
				/* Set CAN error code to Bus-Off */
				errorcode |= LL_CAN_ERROR_BOF;

				/* No need for clear of Error Bus-Off as read-only */
			}

			/* Check Last Error Code Flag */
			if (((interrupts & (1U << LECIE)) != 0U) &&
				((esrflags & (1U << LEC)) != 0U))
			{
				switch (esrflags & (7U << LEC))
				{
				case (1U << LEC):
					/* Set CAN error code to Stuff error */
					errorcode |= LL_CAN_ERROR_STF;
					break;
				case (2U << LEC):
					/* Set CAN error code to Form error */
					errorcode |= LL_CAN_ERROR_FOR;
					break;
				case ((2U << LEC) | (1u << LEC)):
					/* Set CAN error code to Acknowledgement error */
					errorcode |= LL_CAN_ERROR_ACK;
					break;
				case (4U << LEC):
					/* Set CAN error code to Bit recessive error */
					errorcode |= LL_CAN_ERROR_BR;
					break;
				case ((4U << LEC) | (1U << LEC)):
					/* Set CAN error code to Bit Dominant error */
					errorcode |= LL_CAN_ERROR_BD;
					break;
				case ((4U << LEC) | (2U << LEC)):
					/* Set CAN error code to CRC error */
					errorcode |= LL_CAN_ERROR_CRC;
					break;
				default:
					break;
				}

				/* Clear Last error code Flag */
				esrflags &= ~(7U << LEC);
			}
		}

		/* Clear ERRI Flag */
		msrflags &= ~(1U << ERRI);
	}

	/* Call the Error call Back in case of Errors */
	if (errorcode != LL_CAN_ERROR_NONE)
	{
		/* Update error code in handle */
		hcan->ErrorCode |= errorcode;

		LL_CAN_ErrorCallback(hcan);
	}
}

uint32_t Calculate_APB1_clk()
{
	uint32_t PPRE1 = (RCC->CFGR >> 10) & 0x7;
	switch(PPRE1)
	{
	case 0: return (SystemCoreClock/1);//SystemCoreClock=HCLK_freq
	case 4: return (SystemCoreClock/2);
	case 5: return (SystemCoreClock/4);
	case 6: return (SystemCoreClock/8);
	case 7: return (SystemCoreClock/16);
	}

}
